# SQL Basics

**Connecting to our Database**

In [1]:
# We will first load an sql extension into our environment
# This extension will allow us to work with sql on Colaboratory
#
%load_ext sql

# We will then connect to our in memory sqlite database
# NB: This database will cease to exist as soon as the database connection is closed.
# We will learn more about how databases are created later in prep.
#
%sql sqlite://

## **SQL CRUD Operations**

```
Earlier on we briefly talked about the basic operations when it comes database programming. 
Now we are going to practically explore these operations.
Just as a recap, these operations are:
```
----

**C**REATE - Insert row/rows in a table

**R**EAD - Read row/rows in a table

**U**PDATE - Edit row/rows in a table

**D**ELETE - Delete row/ rows in a table


Now let's look at each one of them individually

## **CREATE**

First we need to create a table to be able to perform the crud operations.

So Let's create an empty table first

In [10]:
# we'll create a table that has 3 columns,
# The first column will have country names,
# The second column will have continent of the countries
# Finally, the 3rd column will contain the population of the countries

In [2]:
%%sql
-- drop the table if it already exists

DROP TABLE IF EXISTS countries; 

-- create the table countries with the specified columns name, continent and population
CREATE TABLE countries(
    Name varchar(255),
    Continent varchar(255),
    Population int
);

 * sqlite://
Done.
Done.

[]

## **INSERT Command**

```
The command associated with the create operation is the INSERT INTO command. 
If we want to add rows to our new table we are going to use the INSERT INTO command.
It starts with the `INSERT INTO` keyword then we specify the name of the table that we want add rows to. 
After that we list the column names inside brackets. Lastly, we add the `VALUES` keyword and specify the values  we want the columns to have. 
```
----
Let's add few rows in the table we created above

In [5]:
%%sql

-- Add 5+ columns to countries table
-- From these we can now perform queries to get the data we need from the table.

INSERT INTO countries (Name, Continent, Population)
VALUES 
    ('China','Asia',1433783686),
    ('Nigeria','Africa',200963599),
    ('Kenya','Africa',52573973),
    ('Brazil','North America',211049527),
    ('Russia','Europe',145872256),
    ('United States','North America',331002651),
    ('India','Asia',1380004385),
    ('Indonesia','Asia',273523615),
    ('Pakistan','Asia',220892340),
    ('Bangladesh','Asia',164689383); 

--Note: The values for the column should coincide with the way you have arranged your columns.
--Also, you should be of the same data type as your columns.
--For example, we cannot add and character string in the Population column since we specified that the column should hold integers only.
--Don't worry about viewing the rows we just inserted just yet, we'll do that in the next segment

 * sqlite://
10 rows affected.
Done.

[]

In [6]:
%%sql
-- We can now view the data in the table we just created
SELECT * FROM countries;

 * sqlite://
Done.

[('China', 'Asia', 1433783686),
 ('Nigeria', 'Africa', 200963599),
 ('Kenya', 'Africa', 52573973),
 ('Brazil', 'North America', 211049527),
 ('Russia', 'Europe', 145872256),
 ('United States', 'North America', 331002651),
 ('India', 'Asia', 1380004385),
 ('Indonesia', 'Asia', 273523615),
 ('Pakistan', 'Asia', 220892340),
 ('Bangladesh', 'Asia', 164689383)]

In [7]:
%%sql 
-- select data where the continect is Africa
SELECT * FROM countries WHERE continent = 'Africa';

 * sqlite://
Done.

[('Nigeria', 'Africa', 200963599), ('Kenya', 'Africa', 52573973)]

In [11]:
%%sql 
-- you can order in ASC ~ascending or DESC ~descending
SELECT * FROM countries 
WHERE continent = 'North America'
ORDER BY Name DESC;

 * sqlite://
Done.

[('United States', 'North America', 331002651),
 ('Brazil', 'North America', 211049527)]

In [18]:
%%sql 
-- #select all where continet starts with E i.e Europe, North America.
SELECT * FROM countries 
WHERE continent LIKE 'E%' OR continent LIKE 'N%';

 * sqlite://
Done.

[('Brazil', 'North America', 211049527),
 ('Russia', 'Europe', 145872256),
 ('United States', 'North America', 331002651)]

In [12]:
%%sql
-- select where countries start with K or E
SELECT * FROM countries
WHERE Name LIKE 'K%' OR Name LIKE 'B%';

 * sqlite://
Done.

[('Kenya', 'Africa', 52573973)]

## **Challenges**

In [ ]:
# Create a table that consists your class members. 
# The table should consist of the following columns:
# First and last names
# Email address
# Phone Number
# Number of siblings
# Level of Education
# ------------------------
# Remember to add the relavant data types for each column
# Once you have done that, populate the table with your classmates details

In [17]:
%%sql

DROP TABLE IF EXISTS class_members;

CREATE TABLE class_members(
    first_name VARCHAR(20),
    last_name VARCHAR(20),
    Email VARCHAR(50),
    phone_no VARCHAR(22),
    no_siblings INT,
    education_level VARCHAR(20)
);

 * sqlite://
Done.
Done.

[]

In [20]:
%%sql
-- insert values into your table 
INSERT INTO class_members (first_name,last_name,Email,phone_no,no_siblings,education_level)
VALUES 
    ('Jane','Doe','janedoe@gmail.com','+12345667',3,'High School'),
    ('Peter','Doe','janedoe@gmail.com','+12345667',6,'High School'),
    ('Hassan','Doe','janedoe@gmail.com','+12345667',1,'High School'),
    ('Maliea','Doe','janedoe@gmail.com','+12345667',8,'High School');

 * sqlite://
4 rows affected.

[]

In [21]:
%%sql
--- view data in data 
SELECT * FROM class_members;

 * sqlite://
Done.

[('Jane', 'Doe', 'janedoe@gmail.com', '+12345667', 3, 'High School'),
 ('Jane', 'Doe', 'janedoe@gmail.com', '+12345667', 3, 'High School'),
 ('Peter', 'Doe', 'janedoe@gmail.com', '+12345667', 6, 'High School'),
 ('Hassan', 'Doe', 'janedoe@gmail.com', '+12345667', 1, 'High School'),
 ('Maliea', 'Doe', 'janedoe@gmail.com', '+12345667', 8, 'High School')]

In [28]:
%%sql
--- view students with more than 5 siblings
SELECT * FROM class_members
GROUP BY first_name 
HAVING no_siblings > 5
ORDER BY no_siblings ASC

 * sqlite://
Done.

[('Peter', 'Doe', 'janedoe@gmail.com', '+12345667', 6, 'High School'),
 ('Maliea', 'Doe', 'janedoe@gmail.com', '+12345667', 8, 'High School')]

## **READ**

The Read operation is used to retrieve data from a table.

The command we use to achieve this is the `SELECT` command 

This command is has three parts:


*   **Column Part**:
Here, we apecify the columns that we want to retrieve the data from. We can choose more than 1 column. If you decide to choose more that one column then you have to separate the column names with a comma
*   **Table Part**: 
We put the name of the table from which we get the data from
*   **Filter Part**:
Though this part is mandatory, it allows us to filter the data that we want to view. So essentially the SELECT command can run without this part. We will see how to make use of this part later on.

**Note**: If we want to retrieve data from more than one table we can use the `JOIN` operator. This operator is very important for you as a data scientist. We'll look at it in-depth later on.

In [ ]:
# Now that we have seen how that works, let's retieve data from  specific  columns
# -- When you want to write comments in SQL, we use two dashes (--)
# -- NOTE: When retrieving data from specific columns, make sure the column name you write in the select command matches the actual column name

In [31]:
%%sql
-- Retrieving data from Name and Population columns

SELECT Name, Population FROM countries;

 * sqlite://
Done.

[('China', 1433783686),
 ('Nigeria', 200963599),
 ('Kenya', 52573973),
 ('Brazil', 211049527),
 ('Russia', 145872256),
 ('United States', 331002651),
 ('India', 1380004385),
 ('Indonesia', 273523615),
 ('Pakistan', 220892340),
 ('Bangladesh', 164689383)]

**Using ALIASES in SELECT statements**

Aliases are temporary names that we give tables or columns in the SELECT statements.

There are a number of reason we would opt to use aliases. These reasons can be one of the following:


*   Make the query more readable if the table or column names are complex.
*   If a table is using a query more than one time.

*   It can reduce the query writing effort if the table or column name is long.

In [32]:
%%sql
---# Let's rewrite the our previous two queries with table and column aliases
---#  In the following query, cntry alias wil specify the table name
SELECT cntry.Name FROM countries as cntry;

 * sqlite://
Done.

[('China',),
 ('Nigeria',),
 ('Kenya',),
 ('Brazil',),
 ('Russia',),
 ('United States',),
 ('India',),
 ('Indonesia',),
 ('Pakistan',),
 ('Bangladesh',)]

In [34]:
%%sql
--# In this example, we provide aliases for the column names.
SELECT name as C_Name, population as C_pop FROM countries;

 * sqlite://
Done.

[('China', 1433783686),
 ('Nigeria', 200963599),
 ('Kenya', 52573973),
 ('Brazil', 211049527),
 ('Russia', 145872256),
 ('United States', 331002651),
 ('India', 1380004385),
 ('Indonesia', 273523615),
 ('Pakistan', 220892340),
 ('Bangladesh', 164689383)]

### Challenges

In [35]:
%%sql
---# Retrieve data for your class members table that you created earlier
SELECT * FROM class_members
LIMIT 3;

 * sqlite://
Done.

[('Jane', 'Doe', 'janedoe@gmail.com', '+12345667', 3, 'High School'),
 ('Jane', 'Doe', 'janedoe@gmail.com', '+12345667', 3, 'High School'),
 ('Peter', 'Doe', 'janedoe@gmail.com', '+12345667', 6, 'High School')]

In [38]:
%%sql
---# Create ALIASES for both the table and columns of your class members table
SELECT cm.first_name as fName, cm.last_name as lName 
FROM class_members as cm;

 * sqlite://
Done.

[('Jane', 'Doe'),
 ('Jane', 'Doe'),
 ('Peter', 'Doe'),
 ('Hassan', 'Doe'),
 ('Maliea', 'Doe')]

**Sorting SELECT statements results**

The `ORDER BY` clause allows us to sort results of the SELECT statement according to a specified column or columns

Additionally, we can perform ascending ir descending sorting thanks to the `ORDER BY` clause

Let's see how this works

In [39]:
%%sql
---# Let's sort our countries table according to the population of the countries in ascending order
SELECT * FROM countries as Cntry
ORDER BY  Cntry.population ASC

 * sqlite://
Done.

[('Kenya', 'Africa', 52573973),
 ('Russia', 'Europe', 145872256),
 ('Bangladesh', 'Asia', 164689383),
 ('Nigeria', 'Africa', 200963599),
 ('Brazil', 'North America', 211049527),
 ('Pakistan', 'Asia', 220892340),
 ('Indonesia', 'Asia', 273523615),
 ('United States', 'North America', 331002651),
 ('India', 'Asia', 1380004385),
 ('China', 'Asia', 1433783686)]

### Challenges

In [43]:
%%sql
---# Sort the names of your class members according to the number of siblings 
SELECT * FROM class_members as cm
ORDER BY no_siblings DESC;

 * sqlite://
Done.

[('Maliea', 'Doe', 'janedoe@gmail.com', '+12345667', 8, 'High School'),
 ('Peter', 'Doe', 'janedoe@gmail.com', '+12345667', 6, 'High School'),
 ('Jane', 'Doe', 'janedoe@gmail.com', '+12345667', 3, 'High School'),
 ('Jane', 'Doe', 'janedoe@gmail.com', '+12345667', 3, 'High School'),
 ('Hassan', 'Doe', 'janedoe@gmail.com', '+12345667', 1, 'High School')]

**Filtering SELECT statements**

When retrieving dat from a table, we can decide to filter the results through the `WHERE` clause

In [44]:
%%sql
---# Let's retrieve data from the our table according to country Name but only return the data of Kenya
SELECT * FROM countries 
WHERE Name = 'Kenya'

 * sqlite://
Done.

[('Kenya', 'Africa', 52573973)]

## **UPDATE**

The UPDATE statement is modify existing data in a table

It must include a SET clause so that we can define the target column in which we want to modify

Let's see this in action

In [45]:
%%sql
--# Let's change all of the rows in the population columnn to 1
UPDATE countries SET population = 1;

SELECT * from countries;

 * sqlite://
10 rows affected.
Done.

[('China', 'Asia', 1),
 ('Nigeria', 'Africa', 1),
 ('Kenya', 'Africa', 1),
 ('Brazil', 'North America', 1),
 ('Russia', 'Europe', 1),
 ('United States', 'North America', 1),
 ('India', 'Asia', 1),
 ('Indonesia', 'Asia', 1),
 ('Pakistan', 'Asia', 1),
 ('Bangladesh', 'Asia', 1)]

In the UPDATE statements, we can use the WHERE clause so that we can modify particular row or rows in the table.

In [46]:
%%sql
---# Let's change the kenyan population to 245000
UPDATE countries SET population = 245000
WHERE Name = 'Kenya';

SELECT * FROM countries

 * sqlite://
1 rows affected.
Done.

[('China', 'Asia', 1),
 ('Nigeria', 'Africa', 1),
 ('Kenya', 'Africa', 245000),
 ('Brazil', 'North America', 1),
 ('Russia', 'Europe', 1),
 ('United States', 'North America', 1),
 ('India', 'Asia', 1),
 ('Indonesia', 'Asia', 1),
 ('Pakistan', 'Asia', 1),
 ('Bangladesh', 'Asia', 1)]

## **DELETE**

The Delete statement is used to remove existing row/rows in the table. At first, we will mention how to use the `WHERE` clause in the `DELETE` statements, just because most of the time we want to filter the deleted rows

In [47]:
%%sql
DELETE FROM countries WHERE Name = 'Russia';

SELECT * From countries;

 * sqlite://
1 rows affected.
Done.

[('China', 'Asia', 1),
 ('Nigeria', 'Africa', 1),
 ('Kenya', 'Africa', 245000),
 ('Brazil', 'North America', 1),
 ('United States', 'North America', 1),
 ('India', 'Asia', 1),
 ('Indonesia', 'Asia', 1),
 ('Pakistan', 'Asia', 1),
 ('Bangladesh', 'Asia', 1)]